## Terraform Plan
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # azurerm_monitor_action_group.SRE_GR_AG must be replaced
-/+ resource "azurerm_monitor_action_group" "SRE_GR_AG" {
      ~ id                  = "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/actionGroups/SRE-GR-AG" -> (known after apply)
        name                = "SRE-GR-AG"
      ~ resource_group_name = "pubsec-central-logging-rg-prod" -> "cds-snc-mgmt" # forces replacement
        tags                = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
            "ssc_cbrid"          = "21JA"
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "this" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/scheduledQueryRules/Breakglass Account Signin Attempt" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "Breakglass Account Signin Attempt"
      ~ resource_group_name                    = "pubsec-central-logging-rg-prod" -> "cds-snc-mgmt" # forces replacement
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.OperationalInsights/workspaces/log-analytics-workspace-prod" -> "/subscriptions/6881deca-df81-4b95-ad54-103b0b100a1d/resourceGroups/cds-snc-mgmt/providers/Microsoft.OperationalInsights/workspaces/cds-snc-la",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
            "ssc_cbrid"          = "21JA"
        }
      - target_resource_types                  = [] -> null
        # (11 unchanged attributes hidden)

      ~ action {
          ~ action_groups     = [
              - "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/actionGroups/SRE-GR-AG",
            ] -> (known after apply)
          - custom_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "this" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/scheduledQueryRules/Conditional Access Policy Modification" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "Conditional Access Policy Modification"
      ~ resource_group_name                    = "pubsec-central-logging-rg-prod" -> "cds-snc-mgmt" # forces replacement
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.OperationalInsights/workspaces/log-analytics-workspace-prod" -> "/subscriptions/6881deca-df81-4b95-ad54-103b0b100a1d/resourceGroups/cds-snc-mgmt/providers/Microsoft.OperationalInsights/workspaces/cds-snc-la",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
            "ssc_cbrid"          = "21JA"
        }
      - target_resource_types                  = [] -> null
        # (11 unchanged attributes hidden)

      ~ action {
          ~ action_groups     = [
              - "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/actionGroups/SRE-GR-AG",
            ] -> (known after apply)
          - custom_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Error: populating Resource Provider cache: listing Resource Providers: loading results: unexpected status 404 (404 Not Found) with error: SubscriptionNotFound: The subscription '0bbd06bc-48ac-48bc-9275-c0cbeebef3b6' could not be found.

  with module.saas_app_service_principal.provider["registry.terraform.io/hashicorp/azurerm"],
  on modules/identity_role/main.tf line 46, in provider "azurerm":
  46: provider "azurerm" {

[90m14:04:08.789 [0m[31mERROR  [0mterraform invocation failed in .
[90m14:04:08.789 [0m[31mERROR  [0merror occurred:

* Failed to execute "terraform plan -no-color -input=false -out=plan.tfplan" in .
  
  Error: populating Resource Provider cache: listing Resource Providers: loading results: unexpected status 404 (404 Not Found) with error: SubscriptionNotFound: The subscription '0bbd06bc-48ac-48bc-9275-c0cbeebef3b6' could not be found.
  
    with module.saas_app_service_principal.provider["registry.terraform.io/hashicorp/azurerm"],
    on modules/identity_role/main.tf line 46, in provider "azurerm":
    46: provider "azurerm" {
  
  
  exit status 1


```

</details>

